src/cf/MainBase/DataProcessors/otus_ИнформацияПоАктам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>otus_ИнформацияПоАктам</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокЗаявок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.otus_Заявка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.otus_Договор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПередачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозврата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/MainBase/Enums/otus_СтатусАкта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>otus_СтатусАкта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВозвращено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/MainBase/Enums/otus_СтатусЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>otus_СтатусЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/MainBase/Documents/otus_АктПередачиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>otus_АктПередачиТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварныеЗапасы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусАкта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.otus_Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/MainBase/Documents/otus_Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>otus_Заявка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/MainBase/DataProcessors/otus_ИнформацияПоАктам/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Оформить(Команда)
	Отбор = Новый Структура("Пометка",Истина);
	
	ОтфильтрТаб = Объект.СписокЗаявок.НайтиСтроки(Отбор);
	
	Для Каждого ДокЗаявка ИЗ ОтфильтрТаб Цикл
		
		СтруктураДляПередачи = Новый Структура("Заявка,Контрагент,Договор,ДатаПередачи,ДатаВозврата",ДокЗаявка.Заявка,ДокЗаявка.Контрагент,ДокЗаявка.Договор,ДокЗаявка.ДатаПередачи,ДокЗаявка.ДатаВозврата);
		
		Проверка = ЗапросПроверки(СтруктураДляПередачи);
		
		Если Проверка = Истина Тогда
			ОформитьСервер(СтруктураДляПередачи);
		Иначе
			Сообщить("По данной заявке "+ДокЗаявка.Заявка+" акт создан!");
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры 

Функция ОформитьСервер(Данные)
	
	ТабЧастьТовары = ПолучитьТабличнуюЧасть(Данные.Заявка);
	
	ДокументАкт = Документы.otus_АктПередачиТовара.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ДокументАкт,Данные);
	
	ДокументАкт.СписокТоваров.Загрузить(ТабЧастьТовары);
	
	ДокументАкт.Дата = ТекущаяДата();
	
	ДокументАкт.Статус = Перечисления.otus_СтатусАкта.Формируется;
	
	ДокументАкт.Записать(РежимЗаписиДокумента.Запись);
		
	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТабличнуюЧасть(Документ)

    Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	otus_ЗаявкаТовары.Количество КАК Количество,
	|	otus_ЗаявкаТовары.Товар КАК Товар
	|ИЗ
	|	Документ.otus_Заявка.Товары КАК otus_ЗаявкаТовары
	|ГДЕ
	|	otus_ЗаявкаТовары.Ссылка = &Ссылка
	|";

	Запрос.УстановитьПараметр("Ссылка",Документ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции	


&НаСервереБезКонтекста
Функция ЗапросПроверки(Данные)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	otus_АктПередачиТовара.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.otus_АктПередачиТовара КАК otus_АктПередачиТовара
	|ГДЕ
	|	otus_АктПередачиТовара.Заявка = &Заявка
	|	И otus_АктПередачиТовара.Контрагент = &Контрагент
	|	И otus_АктПередачиТовара.Договор = &Договор
	|";
	Запрос.УстановитьПараметр("Заявка",Данные.Заявка);
	Запрос.УстановитьПараметр("Контрагент",Данные.Контрагент);
	Запрос.УстановитьПараметр("Договор",Данные.Договор);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда
		Возврат  Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	otus_Заявка.Ссылка КАК Заявка,
	|	otus_Заявка.Контрагент КАК Контрагент,
	|	otus_Заявка.Договор КАК Договор,
	|	otus_Заявка.ДатаПередачи КАК ДатаПередачи,
	|	otus_Заявка.ДатаВозврата КАК ДатаВозврата
	|ИЗ
	|	Документ.otus_Заявка КАК otus_Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.otus_АктПередачиТовара КАК otus_АктПередачиТовара
	|		ПО (otus_АктПередачиТовара.Заявка = otus_Заявка.Ссылка)
	|ГДЕ
	|	otus_Заявка.Статус = &Статус
	|	И otus_АктПередачиТовара.Ссылка ЕСТЬ NULL
	|";
	Запрос.УстановитьПараметр("Статус",Перечисления.otus_СтатусЗаявок.Утверждена);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.СписокЗаявок.Загрузить(РезультатЗапроса);
	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСервер()
    Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	otus_Заявка.Ссылка КАК Заявка,
	|	otus_Заявка.Контрагент КАК Контрагент,
	|	otus_Заявка.Договор КАК Договор,
	|	otus_Заявка.ДатаПередачи КАК ДатаПередачи,
	|	otus_Заявка.ДатаВозврата КАК ДатаВозврата
	|ИЗ
	|	Документ.otus_Заявка КАК otus_Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.otus_АктПередачиТовара КАК otus_АктПередачиТовара
	|		ПО (otus_АктПередачиТовара.Заявка = otus_Заявка.Ссылка)
	|ГДЕ
	|	otus_Заявка.Статус = &Статус
	|	И otus_АктПередачиТовара.Ссылка ЕСТЬ NULL
	|";
	Запрос.УстановитьПараметр("Статус",Перечисления.otus_СтатусЗаявок.Утверждена);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
    Объект.СписокЗаявок.Загрузить(РезультатЗапроса);	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДинСписок(Команда)
	Элементы.БлижайшийСрокВозврата.Обновить();
КонецПроцедуры
